[
  {
    "title": "Nintendo Switch Pro Controller",
    "current_price": "$68.98",
    "list_price": "$69.99",
    "average_price": "$68.82",
    "category": "video-games",
    "badge": "",
    "link": "https://camelcamelcamel.com/Nintendo-Switch-Pro-Controller/product/B01NAWKYZ0?active=price_amazon&context=popular",
    "camel_img": "https://images-na.ssl-images-amazon.com/images/I/41nUdEeyymL._UL320_.jpg",
    "amazon_title": "Nintendo Switch Pro Controller",
    "amazon_link": "https://www.amazon.com/dp/B01NAWKYZ0",
    "img": "https://m.media-amazon.com/images/I/41lo7JOm0UL._SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Take your game sessions up a notch with the Nintendo Switch Pro Controller. Includes motion controls, HD rumble, built-in amiibo functionality, and more.\n\nKontrolFreek Thumbsticks\nSelect KontrolFreek Thumbsticks are compatible with the Nintendo Switch Pro Controller.",
    "features": "Take your game sessions up a notch with the Nintendo Switch Pro Controller\nHandheld Nintendo Switch gaming at a great price\nComes with charging cable (USB C to USB A)\nIncludes motion controls, HD rumble, built-in amiibo functionality, and more. (amiibo not included)",
    "lowest_price_date": "Jun 05, 2017",
    "lowest_price": "$64.00",
    "highest_price_date": "Apr 20, 2017",
    "highest_price": "$69.99",
    "current_price_date": "Sep 19, 2017"
  },
  {
    "title": "Nintendo Switch – OLED Model w/ Neon Red & Neon Blue Joy-Con",
    "current_price": "$349.99",
    "list_price": "$349.99",
    "average_price": "$349.49",
    "category": "video-games",
    "badge": "",
    "link": "https://camelcamelcamel.com/product/B098RL6SBJ?active=price_amazon&context=popular",
    "camel_img": "https://m.media-amazon.com/images/I/41NGReMC+TL._UL320_.jpg",
    "amazon_title": "Nintendo Switch – OLED Model w/ Neon Red & Neon Blue Joy-Con",
    "amazon_link": "https://www.amazon.com/dp/B098RL6SBJ",
    "img": "https://m.media-amazon.com/images/I/41NGReMC+TL._SX342_SY445_.jpg",
    "description": "Play at home or on the go with a vibrant OLED screen Play on your TV at home or pick up and play in handheld mode on a vivid 7-inch OLED screen with the Nintendo Switch™ – OLED Model system. The system also features 64 GB of internal storage, enhanced audio, a wide adjustable stand, and a dock with a wired LAN port.",
    "features": "Vivid 7” OLED screen\nLocal co-op, online, and local wireless multiplayer\n64 GB internal storage (a portion of which is reserved for use by the system)\nEnhanced audio in handheld and tabletop modes\nWide adjustable stand",
    "lowest_price_date": "Dec 10, 2022",
    "lowest_price": "$349.00",
    "highest_price_date": "Apr 16, 2022",
    "highest_price": "$349.99",
    "current_price_date": "Apr 02, 2023"
  },
  {
    "title": "Star Wars Jedi: Survivor - PlayStation 5",
    "current_price": "$34.97",
    "list_price": "$69.99",
    "average_price": "$63.33",
    "category": "video-games",
    "badge": "Best Price",
    "link": "https://camelcamelcamel.com/product/B0BP5KV13Q?active=price_amazon&context=popular",
    "camel_img": "https://m.media-amazon.com/images/I/41vT4jwX-8L._UL320_.jpg",
    "amazon_title": "Star Wars Jedi: Survivor - PlayStation 5",
    "amazon_link": "https://www.amazon.com/dp/B0BP5KV13Q",
    "img": "https://m.media-amazon.com/images/I/41vT4jwX-8L._SX300_SY300_QL70_FMwebp_.jpg",
    "description": "The story of Cal Kestis continues in Star Wars Jedi: Survivor, a third person galaxy-spanning action-adventure game from Respawn Entertainment, developed in collaboration with Lucasfilm Games. This narratively-driven, single player title picks up five years after the events of Star Wars Jedi: Fallen Order and follows Cal’s increasingly desperate fight as the galaxy descends further into darkness. Pushed to the edges of the galaxy by the Empire, Cal will find himself surrounded by threats new and familiar. As one of the last surviving Jedi Knights, Cal is driven to make a stand during the galaxy’s darkest times - but how far is he willing to go to protect himself, his crew, and the legacy of the Jedi Order? To survive, players will build upon Cal’s training with an expanded list of iconic Force abilities, combat stances, and lightsaber customizations that can be combined in new and different ways to fight as a Jedi. While the Force is a powerful ally, it may not be enough. Cal will have to get creative and master new abilities, tactics and even leverage the environment around him to overcome the obstacles ahead.",
    "features": "Continue Cal’s Journey - No longer a Padawan, Cal has come into his own and grown into a powerful Jedi Knight.\nGo Beyond Your Training – The cinematic combat system returns with additional Force abilities and new lightsaber fighting styles.\nExplore an Untamed Galaxy – Discover new planets and familiar frontiers in the Star Wars galaxy, each with unique challenges, and enemies.\nThe Dark Times are closing in – with enemies surrounding him, Cal will need to decide how far he’s willing to go to save those closest to him.\nSome features may require an internet connection and an online subscription.",
    "lowest_price_date": "Nov 17, 2023",
    "lowest_price": "$34.97",
    "highest_price_date": "Dec 08, 2022",
    "highest_price": "$69.99",
    "current_price_date": "Nov 17, 2023"
  },
  {
    "title": "8BitDo Sn30 Pro Bluetooth Controller for Switch/Switch OLED, PC, macOS, Android, Steam Deck & Raspberry Pi (G Classic Edition)",
    "current_price": "$44.99",
    "list_price": "$44.99",
    "average_price": "$44.12",
    "category": "video-games",
    "badge": "",
    "link": "https://camelcamelcamel.com/product/B07GKLG3ZP?active=price_amazon&context=popular",
    "amazon_title": "8BitDo Sn30 Pro Bluetooth Controller for Switch/Switch OLED, PC, macOS, Android, Steam Deck & Raspberry Pi (G Classic Edition)",
    "amazon_link": "https://www.amazon.com/dp/B07GKLG3ZP",
    "img": "https://m.media-amazon.com/images/I/41JWWyUYRUL._SX300_SY300_QL70_FMwebp_.jpg",
    "description": "The one Controller to rule them all. Inspired by the classic game boy. Fully featured Controller- clickable joysticks, rumble vibration, motion controls, wireless Bluetooth, rechargeable battery, home and screenshot buttons and a USB-C connector!. Perfect classic d-pad. Controller mode X-input, D-input, Mac mode, Switch mode.",
    "features": "Compatible with iPhone, iPad, macOS and Apple TV now. (Officially Supported)\nCompatible with Apple, Switch, PC, Android, Steam Deck & Raspberry Pi.\nFully featured Controller- clickable joysticks, rumble vibration, motion controls, wireless Bluetooth, rechargeable battery, home and screenshot Buttons and a USB-C connector\nPerfect classic d-pad",
    "lowest_price_date": "Jan 11, 2021",
    "lowest_price": "$35.09",
    "highest_price_date": "May 14, 2020",
    "highest_price": "$44.99",
    "current_price_date": "Nov 17, 2023"
  },
  {
    "title": "ROCCAT Vulcan Pro Linear Optical PC Gaming Keyboard, Titan Switch Full Size with Per Key AIMO RGB Lighting, Anodized Aluminum Top Plate and Detachable Palm/Wrist Rest, Low Profile, Black",
    "current_price": "$49.99",
    "list_price": "$159.99",
    "average_price": "$101.20",
    "category": "video-games",
    "badge": "Best Price",
    "link": "https://camelcamelcamel.com/product/B08J4HQGZ2?active=price_amazon&context=popular",
    "amazon_title": "ROCCAT Vulcan Pro Linear Optical PC Gaming Keyboard, Titan Switch Full Size with Per Key AIMO RGB Lighting, Anodized Aluminum Top Plate and Detachable Palm/Wrist Rest, Low Profile, Black",
    "amazon_link": "https://www.amazon.com/dp/B08J4HQGZ2",
    "img": "https://m.media-amazon.com/images/I/81c5s0yiyXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "The ROCCAT Vulcan Pro is the full-size series variant that features the linear Titan Switch Optical. ROCCAT is the first in the industry to engineer an optical switch that has a familiar mechanical key stroke feeling. This technology equips you with lightspeed actuation and incredible precision. The switch adds to a comprehensive feature set that gamers know and love. The low-profile design is engineered for comfort and to reduce fatigue, impressive durability and build quality thanks to its reinforcing black anodized aluminum top plate and switches rated to 100 million keystrokes, dedicated mixer-style audio controls, detachable palm rest and per-key AIMO RGB lighting. We’re confident in the quality and longevity of our products. To ensure additional peace of mind we provide a 2-year limited manufacturer warranty.",
    "features": "Optical Speed, Linear Mechanical Feel - ROCCAT’s new linear Titan Switch Optical actuates at the speed of light for a whole new level of speed and responsiveness, whilst retaining the signature keystroke feel of mechanical\nADVANCED ANTI-GHOSTING - Technology optimized for gamers to ensure every key stroke of the most-used keys is registered – no matter how frantic the action gets\nAIMO ILLUMINATION - ROCCAT’s proprietary lighting eco-system connects compatible devices present vivid lighting scenarios right out of the box, without the need for extensive configuration; With full backlighting in 16.8 million colors\nMIXER-STYLE MEDIA CONTROLS - The volume dial and backlit media buttons allow you to adjust volume and mute on the fly, or toggle over to lighting control to adjust brightness\nCUSTOMIZED YOUR WAY - ROCCAT’s Easy-Shift Plus technology adds a secondary function to compatible keys; Just hold down the designated modifier key for double the command power in an instant\nDETACHABLE PALM REST - Attaching with a premium magnetic solution, the included palm rest lets you adjust your setup to whatever’s comfortable for you, whether it’s a relaxed typing or aggressive gaming style\nLONG LASTING DURABILITY - Optical switches function contactlessly and prevent the build-up of rust, effectively doubling their lifecycle to 100m keystrokes; An aircraft-grade black anodized aluminum top plate reinforces the keyboard for extra strength",
    "lowest_price_date": "Nov 12, 2023",
    "lowest_price": "$49.99",
    "highest_price_date": "Aug 23, 2021",
    "highest_price": "$199.99",
    "current_price_date": "Nov 12, 2023"
  },
  {
    "title": "Remnant 2 for PlayStation 5",
    "current_price": "$36.99",
    "list_price": "$49.99",
    "average_price": "$45.24",
    "category": "video-games",
    "badge": "Best Price",
    "link": "https://camelcamelcamel.com/product/B0C3794Q5J?active=price_amazon&context=popular",
    "amazon_title": "Remnant 2 for PlayStation 5",
    "amazon_link": "https://www.amazon.com/dp/B0C3794Q5J",
    "img": "https://m.media-amazon.com/images/I/51iXkHgNpFL._SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unimaginable Worlds. Unrelenting Odds Remnant II is the sequel to the best-selling game Remnant: From the Ashes that pits survivors of humanity against new deadly creatures and god-like bosses across terrifying worlds. Play solo or co-op with two other friends to explore the depths of the unknown to stop an evil from destroying reality itself. To succeed, players will need to rely on their own skills and those of their team to overcome the toughest challenges and to stave off humanity's extinction.",
    "features": "Intense Remnant Combat Experience - A mix of methodical and frenetic ranged/melee combat returns with cunning enemies and large scale boss battles. Choose specific gear and weapons to optimize for the different biomes and battles ahead. Bosses will bring high-level players to team up to overcome the challenge and try to obtain the biggest rewards\nNew Worlds to Explore - Players can travel alone or with friends as a team through strange new worlds and beyond, overrun by mythical creatures and deadly foes while trying to stay alive. There are multiple worlds to explore with different types of creatures, weapons, and items. Utilize and upgrade discovered items to take on tougher challenges\nEndless Replayability - Branching quest lines, augments, crafting, and loot rewards will test the resolve of even the most hardened players in dynamically generated dungeons and areas. Playthroughs will feel challenging, varied, and rewarding as players succeed against unrelenting odds. Various stories are woven throughout the different worlds, encouraging exploration and multiple revisits\nNew Archetypical Progression - Expanded Archetype system provides players with unique passive bonuses and stunning powers. Multiple Archetypes can be unlocked during play, leveled up, and equipped together for a variety of play styles",
    "lowest_price_date": "Nov 15, 2023",
    "lowest_price": "$36.99",
    "highest_price_date": "Apr 26, 2023",
    "highest_price": "$49.99",
    "current_price_date": "Nov 15, 2023"
  },
  {
    "title": "PlayStation®5 Console – Marvel’s Spider-Man 2 Bundle",
    "current_price": "$499.00",
    "list_price": "$559.99",
    "average_price": "$529.49",
    "category": "video-games",
    "badge": "Best Price",
    "link": "https://camelcamelcamel.com/product/B0CK9PPX24?active=price_amazon&context=popular",
    "amazon_title": "PlayStation®5 Console – Marvel’s Spider-Man 2 Bundle",
    "amazon_link": "https://www.amazon.com/dp/B0CK9PPX24",
    "img": "https://m.media-amazon.com/images/I/31KoYz1W1tL._SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Swing your way through Marvel’s New York with the PlayStation®5 Console – Marvel’s Spider-Man 2 Bundle. Experience Marvel’s Spider-Man 2 with PS5 innovations. Feel the force of web-swinging with adaptive triggers, while haptic feedback responds to Peter Parker’s new symbiote abilities and Miles Morales’ evolved bio-electric skills. Play as Peter Parker and Miles Morales as they face the ultimate test to save the city from Venom and the symbiote threat. Swing, jump, and utilize the new Web Wings to travel across Marvel’s New York, quickly switching between Peter Parker and Miles Morales to experience different stories and epic new powers, as the iconic villain Venom threatens to destroy their lives, their city, and the ones they love. Marvel’s Spider-Man 2 on PlayStation 5: Haptic Feedback: Feel the power of Spider-Man! The responsive vibrations of the DualSense™ wireless controller bring Peter Parker’s symbiote abilities and Miles Morales’ bio-electric skills to your fingertips. Adaptive Triggers: Master acrobatic moves, execute thrilling combos, and experience the breathtaking excitement of web-swinging traversal through the DualSense wireless controller’s adaptive triggers. Ultra high-speed SSD: Experience the power of the PlayStation®5 console with lightning-fast load times for near-instant character switching across different parts of the city.",
    "features": "PlayStation5 Console – Marvel’s Spider-Man 2 Bundle includes:\nPlayStation 5 console\nDualSense wireless controller\nASTRO’s PLAYROOM (Pre-installed game. PS5 console may need to be updated to the latest system software version. Internet connection required.)\nMarvel’s Spider-Man 2 full game voucher Account for PlayStationNetwork and internet connection required to redeem voucher. Full terms apply—see playstation.com/legal.",
    "lowest_price_date": "Nov 08, 2023",
    "lowest_price": "$499.00",
    "highest_price_date": "Oct 20, 2023",
    "highest_price": "$559.99",
    "current_price_date": "Nov 08, 2023"
  }
]
